{"basics":{"name":"Abhinav Singh Chauhan","label":"Software Engineer","image":"","email":"abhinav.chauhan@stonybrook.edu","phone":"929-569-6994","url":"","summary":"","location":{"address":"700 Health Sciences Drive","postalCode":"NY 11790","city":"Stony Brook","countryCode":"US","region":"New York"},"profiles":[{"network":"Linkedin","username":"abhinavsinghchauhan97","url":"https://linkedin.com/abhinavsinghchauhan97"}]},"work":[{"name":"Target Corporation","position":"Software Engineer","url":"https://www.target.com","startDate":"2019-07-15","endDate":"2022-06-15","summary":"Software Development Engineer, Core Commerce - Target Tech","highlights":[" Designed Kafka Consumer Segregation design for “Order Pick Up” and “Ship from Store” flows achieving 20 percent increment in the microservice scalability."," Redesigned Target ”Real-Time Order Modification System” facilitating guests with possible substitute items while placing the orders; led to 30 percent load reduction on the release microservices."," Collaborated with the Payments team to develop SNAP EBT payments capability resulting in a 20 percent increase in SNAP digital sales."," Deployed a digital event loader microservice achieving a 30 percent reduction in delivery time of Digital Download orders."," Consolidated snapshot loader and order loader microservice for consuming events from different microservices; and updating the order database, reducing optimistic deadlock exceptions from 2k to less than 100 per day."," Implemented the database transaction flow for fetching, and updating the order DB in a single update, attained 50 percent less database calls."," Developed an automation suite for integration testing of order modification repromise and substitution design, instrumental in 100 percent automation of integration tests in end-to-end order flows."]},{"name":"UST Global","position":"Software Engineer Intern","url":"https://www.ust.com","startDate":"2018-07-15","endDate":"2018-12-15","summary":"Software Development Intern","highlights":["Attained 100 percent automation of ”Intelligent Loan System” using REST API to deliver insurance claims to BMW clients on the basis of database-generated profiles.","Analyzed distributed ledger technology focusing on HashGraph, which is 50k times faster than Blockchain."]}],"volunteer":[],"education":[{"institution":"Stony Brook University, New York","url":"https://www.stonybrook.edu/","area":"Computer Science and Engineering","studyType":"MS","startDate":"2022-08-22","endDate":"","courses":["Distributed Systems","Computational Models","Networking Algorithms and Analysis","Machine Learning","Deep Learning","Convex Optimization","Practical ML and AI"]},{"institution":"BITS Pilani, India","url":"https://www.bits-pilani.ac.in/","area":"Electronics Engineering","studyType":"BS","startDate":"2015-08-01","endDate":"2019-05-15","summary":["Web Data Mining and Collaborative Filtering for Personalization of Web Search","Demonstrated a 12 percent higher average F-measure in comparison to web search engines using personalization algorithms.","Generation of User Interest Profile for Web Search Personalization - Developed a DCIT tree enhanced through collaborative filtering and generated content improved 10.5 percent average precision and 12.4 percent increment in average recall compared to personalized results of web search engines.","Achieved personalized results on ranking of web pages using recommendation system and summarization model with a precision accuracy of 70 percent."]}],"certificates":[{"name":"Data Structures and Algorithms Specialization","issuer":"Coursera - UC San Diego","date":"May 2021","url":"https://www.coursera.org/account/accomplishments/specialization/certificate/RDXUQAECGTYH"},{"name":"Object Oriented Programming in JAVA Specialization","issuer":"Coursera - UC San Diego, Duke University","date":"June 2021","url":"https://www.coursera.org/account/accomplishments/specialization/certificate/P9UEPNN95RNF"}],"publications":[],"skills":[],"languages":[{"language":"Hindi","fluency":"Native speaker"},{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[{"name":"Amazon DynamoDB Prototype implementation with Raft Consensus Protocol","startDate":"2022-07-07","endDate":"2022-09-09","highlights":["Implemented Raft consensus protocol to design a fault-tolerant key/value storage system across 5 server replicas.","Engineered a set of Raft instances to maintain enhanced replicated logs across 20 servers and 4 replica groups."]},{"name":"Thread Safety in Multi-Threaded Microservice Architecture","startDate":"2020-08-08","endDate":"2020-10-10","highlights":["Implemented a WorkFlow Executor model to analyze thread safety in a multi-threaded processor achieving a 20 percent efficient processing.","Orchestrated a thread pool management strategy, leading to a 35 percent overall system efficiency improvement, achieved by reducing thread contention and optimizing resource utilization."]},{"name":"ChatBot implementation with LSTM and CBOW","startDate":"2023-03-03","endDate":"2023-05-05","highlights":["Designed LSTM and CBOW models for a chat system, achieving an impressive 93 percent accuracy rate in comprehending and generating responses to user queries.","Effectively mitigated overfitting and guaranteed robust model performance with a consistent epoch loss reduction of only 6 percent, showcasing adept model optimization and training."]},{"name":"Web Data Mining and Collaborative Filtering for Personalization of Web Search","startDate":"2019-02-02","endDate":"2019-05-05","highlights":["Demonstrated a 12 percent higher average F-measure in comparison to web search engines using personalization algorithms."]},{"name":"Generation of User Interest Profile for Web Search Personalization","startDate":"2018-01-02","endDate":"2018-05-05","highlights":["Developed a DCIT tree enhanced through collaborative filtering and generated content improved 10.5 percent average precision and 12.4 percent increment in average recall compared to personalized results of web search engines.","Achieved personalized results on ranking of web pages using recommendation system and summarization model with a precision accuracy of 70 percent."]}]}